ninety_nine_cats_i/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cat = Cat.find_by(id: params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["birth_date", "1932-02-22"], ["color", "red"], ["name", "julie"], ["sex", "M"], ["description", "  \r\nold cat"]]
---
  def create
    @cat = Cat.new(cat_params)

    if @cat.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cat = Cat.find_by(id: params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "sex" = $2, "description" = $3 WHERE "cats"."id" = $4  [["name", "dacydacy"], ["sex", "M"], ["description", "  lorem ipsum dolor sit amet\r\n"], ["id", 1]]
---
  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(cat_params)